#include<iostream>
#include<locale.h>
#include<iomanip>
#include<bitset>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");

	//транспонирование
	//умножение деление и пр со скал€ром
	//умножение двух матриц поэлементное

	//умножение двух матриц матричное
	//умножение матрицы на вектор
	//скал€рное умножение двух векторов
	//векторное умножение двух векторов


	// все вектора длиной 3
	// все матрицы длиной 3х3
	// 1) написать код дл€ ввода исходных данных (элементы матрицы/вектора)
	// 2) написать код дл€ выполнени€ действи€ по варианту
	// 3) написать код дл€ печати исходных и итоговых матриц скал€ров и векторов


	double cho[3][3] = { 0 };
	 cout << "¬ведите элементы матрицы: "<<  endl;
	for (int a = 0; a < 3; a++)
	{
		for (int b = 0; b < 3; b++)
		{
			 cout << "—трока " << a << "  олонка " << b;
			 cin >> cho[a][b];
		}

	}
	double che[3][3] = { 0 };
	 cout << "¬ведите элементы второй матрицы: " <<  endl;
	for (int a = 0; a < 3; a++)
	{
		for (int b = 0; b < 3; b++)
		{
			 cout << "—трока " << a << "  олонка " << b;
			 cin >> che[a][b];
			 cout << che[a][a] << " ";
		}
		 cout <<  endl;
	}


	system("pause");
	return 0;
}