#include<iostream>
#include<locale.h>
#include<iomanip>
#include<bitset>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");

	int binary_int01 = 0b1011;
	int binary_int02 = 0b1100;
	 cout << "Таблица бинарных значений " <<  endl;
	 cout << "Бинарное число 01 = " <<  hex <<  bitset<4>(binary_int01) <<  endl;
	 cout << "Бинарное число 02 = " <<  hex <<  bitset<4>(binary_int02) <<  endl;
	 cout << " —----" <<  hex <<  endl;
	 cout << "Результат " <<  hex <<  bitset <4>(binary_int01 ^ binary_int02) <<  endl;

	int binary_int03 = 0b1011;
	int binary_int04 = 0b1100;
	 cout << "Таблица бинарных значений " <<  endl;
	 cout << "Бинарное число 01 = " <<  hex <<  bitset<4>(binary_int03) <<  endl;
	 cout << "Бинарное число 02 = " <<  hex <<  bitset<4>(binary_int04) <<  endl;
	 cout << " —----" <<  hex <<  endl;
	 cout << "Результат " <<  hex <<  bitset <4>(binary_int03 & binary_int04) <<  endl;

	int binary_int05 = 0b1011;
	int binary_int06 = 0b1100;
	 cout << "Таблица бинарных значений " <<  endl;
	 cout << "Бинарное число 01 = " <<  hex <<  bitset<4>(binary_int05) <<  endl;
	 cout << "Бинарное число 02 = " <<  hex <<  bitset<4>(binary_int06) <<  endl;
	 cout << " —----" <<  hex <<  endl;
	 cout << "Результат " <<  hex <<  bitset <4>(binary_int05 | binary_int06) <<  endl;

	 cout << "демонстарция оператора << " <<  hex <<  bitset <4>(binary_int01 << binary_int02) <<  endl;

	 cout << "демонстарция оператора >> " <<  hex <<  bitset <4>(binary_int03 >> binary_int04) <<  endl;

	 cout << "демонстарция оператора ~ " <<  hex <<  bitset <4>(~binary_int05) <<  endl;

	int c = 2;
	int a = 3;
	int d = 4;
	int b = 1;

	/* 2. унарные, бинарные и один тернарный
	унарные - работающие с единственным операндом ( пример - !, ~, ++, —)
	бинарные - работают с двумя операндами (примеры +, -, >>, <<, &&, ||, &, |, ^, /, *, %)
	тернарный - работает с тремя операндами (логическое_условие?ветка_если_true:ветка_если_false )
	операнд - данные, к которым применяется оператор

	—-----------------------------------------------------------------—

	демонстрация работы побитовых операторов
	*/
	 cout << "a = " <<  bitset<8>(a) << "; b =" << b
		<< "; a >> b = " <<  bitset<8>(a >> b) <<  endl;

	 cout << "a = " <<  bitset<8>(a) << "; b = " << b
		<< "; a >> b = " <<  bitset<8>(a << b) <<  endl;

	 cout << "a = " <<  bitset<8>(a) << "; ~a = " <<  bitset<8>(~a) <<  endl;

	//если оператор ++ стоит после числа, то число сначала выводится на печать, а затем увеличивается
	//если оператор ++ стоит перед числом, то число сначала увеличивается а затем выводится на печать




	//ТИПЫ ДАННЫХ ЯЗЫКА С/С++

	//2.1 целочисленные типы используются для хранения целых чисел положительынбъ, отрицательных и беззнаковых

	char uchar_var; //название любое | Занимает памяти 8 бит (байт) может хранить числа от -128 до 127
	short short_var; // занимает в памяти 16 бит ( 2 байта) хранит числа от 32 767 до -32 768
	int int_var; // занимает в памяти 32 бита ( 4 байта) хранит числа от int32_min до int32_max
	long long_var; // аналогична int
	long int li_var; // занимает 64 бит (8 байт) хранит от llong_min до llong_max
	long long uli_var; // аналог long int


	//если приписать к любому целому знаоковму типу модификатор unsign, то
	// положительный диапазон (т.е максимально положительное число увеличивается в 2 раза
	// в число с меткой unsign нельзя будет записать отрицательные числа

	unsigned char char_var; //размер тот же что и у типа char но диапазон начинается с 0 до 255 (127*2+1)
	unsigned short ushort_var; // аналогично
	unsigned int uint_var; // аналогично
	unsigned long ulong_var; // аналогично
	unsigned long int uuli_var; // аналогично
	unsigned long

		long uuuli_var; // аналогично

		//2.2 арифметические типы с плавающей запятой/точкой
	float float_var; // имеет объем 4 байта (32 бита) и может представлять числа от flt_min до flt_max
	double dbl_var; // имеет объем 8 байт ( 64 бита) может представлять от dbl_min до dbl_max

	//2.3 логические типы данных

	bool bool_var; //может представлять всего 2 значения true и false но имеет длину
	 cout <<  endl << "длина типа bool(в 64 разрядном приложении) sizeif(bool) = "
		<< sizeof(bool) <<  endl;
	//2.4 символьные типы данных
	char chr_var; //диапазона ариыметического типа char очень кстати хватает на кодирование таблицы символов
	//поэтому чаще тип char используется именно для хранения символов и строк чем для арифметики

	wchar_t wchr_var; //имеет объем 16 бит (2 байта) и введен для хранения символов юникода
	//или других расширенных кодировок

	//2.5 универсальный или пустой тип void
	//компилятор рассматривает void просто как ячейку с неопределенными данными
	//служебный тип данных может использоваться как заглушка если функция не возвращает и не принимает значений либо в сложных конструкциях







	 system("pause"); // вызов функции system() из стандартной библиотеки

	return 0;
}
